{
  "basics": {
    "name": "Mehlial Kazmi",
    "label": "Senior Data Scientist",
    "image": "",
    "email": "mehlial.hassan99@gmail.com",
    "url": "https://Kaz545.github.io/",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Istanbul",
      "countryCode": "Turkiye",
      "region": ""
    }
  },
  "work": [
    {
      "name": "Afiniti",
      "position": "Senior Data Scientist",
      "url": "https://www.afiniti.com/",
      "startDate": "2020-06-01",
      "endDate": "Present",
      "highlights": [
        "Leveraged Bayesian statistics and Machine learning models to contribute to generating over $3M in incremental monthly revenue for our client, AT&T.", 
        "Applied word2vec for NLP-based feature engineering creating word embeddings for a text variable. Employed K-means clustering to group similar records, resulting in a remarkable 20% improvement in model performance.", 
        "Analyzed 2.7M historical customer transcript records to assess churn probabilities. Transformed textual data into embedding spaces using BERT and clustered these embeddings with HDBSCAN. Identified a significant number of customers in the cluster linked to service cancellations. By calculating the Euclidean distance from each customer's embedding to this cluster's centroid, derived a churn score, with shorter distances indicating a higher likelihood of churn.", 
        "Employed caretEnsemble to develop an ML model that effectively identified prediction and feature drift across over 1.5M data points. The findings were crucial in diagnosing the root cause of a 15% decline in model performance.", 
        "Utilized scikit-learn's Random Forest to assess feature importance using Gini and Permutation algorithms. Enhanced feature selection with SHAP, leading to a 10% improvement in production models' performance, efficacy, and accuracy.", 
        "Led a team in developing an interactive technical dashboard for diagnosing and resolving ML model issues, such as concept drift. This tool reduced model debugging time by 5 hours per week.", 
        "Devised agent rankings in a call-center setting using Bayesian statistics and probabilistic programming language tool - Stan. Additionally, built a Deep Learning model with TensorFlow for an alternative ranking methodology."
      ]
    }
  ],
  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "location": "Atlanta, GA, USA",
      "url": "https://www.gatech.edu/",
      "area": "Analytics",
      "studyType": "MSc",
      "startDate": "2022-01-01",
      "endDate": "2024-12-01",
      "score": "3.90",
      "courses": ["Deep Learning", "Big Data for Healthcare", "Data and Visual Analytics", 
      "Computation Data Analytics - ML I", "High Dimensional Data Analytics - ML II", "Deterministic Optimization", 
      "Data Analytics for Business"]
    },
    {
      "institution": "Lahore University of Management Technology",
      "location": "Lahore, Pakistan.",
      "url": "https://lums.edu.pk/",
      "area": "Economics, Mathematics and Computer Science",
      "studyType": "BSc",
      "startDate": "2016-09-01",
      "endDate": "2020-05-01",
      "score": "3.60",
      "courses": ["Applied Probability", "Machine Learning", "Econometrics", 
      "Data Structures and Algorithms"]
    }
  ],

  "certificates": [
    {
      "name": "Machine Learning",
      "date": "2018-01-01",
      "issuer": "Stanford University",
      "url": "https://example.com",
      "icon": "fa-solid fa-location-dot"
    }
  ],
  "skills": [
    {
      "name": "Machine Learning",
      "level": "Master",
      "icon": "",
      "keywords": [
        "Numpy", "TensorFlow"
        
      ]
    }
  ],
  "languages": [
    {
      "language": "Urdu",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": ""
    }
  ],
  "projects": [
    {
      "name": "Hotel Reviews Dashboard",
      "summary": "Conducted an in-depth analysis of a vast hotel reviews dataset comprising 505k observations. Employed the BERTopic natural language processing framework to discern and highlight the primary topics within the reviews. Additionally, developed an interactive Tableau dashboard, enabling the visualization of main topics over time for individual hotels, facilitating proactive decision-making.",
      "highlights": ["NLP", "Data Visualization"],
      "startDate": "",
      "endDate": "",
      "url": ""
    }, 
    {
      "name": "Detecting Social Media Toxicity",
      "summary": "Developed a robust methodology for detecting toxic comments using the Wikipedia Detox dataset. Conducted comprehensive data preprocessing and employed word2vec to generate word embeddings, serving as feature inputs for various machine learning models such as Logistic Regression, KNN, Naive Bayes, Random Forest, and AdaBoost. Identified the model with superior performance across multiple key metrics.",
      "highlights": ["ML", "Word2Vec"],
      "startDate": "",
      "endDate": "",
      "url": ""
    }, 
    {
      "name": "BrainMRI-GPT",
      "summary": "Designed a dialogue-driven tool for brain tumor MRI analysis, utilizing CLIP and a custom lightweight model for precise patch-level tumor localization. Integrated results with Llama-3.2-11b vision model and engineered prompts, allowing intuitive and interactive MRI interpretation.",
      "highlights": ["LLM", "CV"],
      "startDate": "",
      "endDate": "",
      "url": ""
    }, 
    {
      "name": "Semantic-Based Recommendation Model",
      "summary": "Leveraged the Amazon Fine Foods review dataset to create a sophisticated recommendation system. Transformed textual data into an embedding space, extracting nuanced semantic meanings through the distilroBERTa model. These embeddings were then utilized as inputs for a Neural Collaborative Filtering (NCF) model, enhancing the accuracy and relevance of the recommendations provided.",
      "highlights": ["RS", "NLP"],
      "startDate": "",
      "endDate": "",
      "url": ""
    }, 
    {
      "name": "Attention-Based Clinical Data Analysis",
      "summary": "Implemented cutting-edge methodology for clinical time series data using masked self-attention, positional encoding, and dense interpolation, outperforming LSTM and logistic regression models with up to 5% improvement in prediction accuracy on MIMIC-III datasets.",
      "highlights": ["Healthcare", "Transformers"],
      "startDate": "",
      "endDate": "",
      "url": ""
    }
  ]
}
